[{"address1": "1 North B Street", "address2": "Suite 2000", "city": "San Mateo", "state": "CA", "zip": "94401", "country": "United States", "phone": "650 289 3060", "website": "https://www.htgc.com", "industry": "Asset Management", "sector": "Financial Services", "longBusinessSummary": "Hercules Capital, Inc. is a business development company. The firm specializing in providing private equity, venture debt, and growth capital to privately held venture capital-backed companies at all stages of development from mid venture to expansion stage including select publicly listed companies and select special opportunity companies that require additional capital to fund acquisitions, recapitalizations and refinancing and established-stage companies. The firm provides growth capital financing solutions for capital extension; management buy-out and corporate spin-out financing solutions; company, asset specific, or intellectual property acquisition financing; convertible, subordinated and/or mezzanine loans; domestic and international corporate expansion; vendor financing; revenue acceleration by sales and marketing development, and manufacturing expansion. It provides asset-based financing with a focus on cash flow; accounts receivable facilities; equipment loans or leases; equipment acquisition; facilities build-out and/or expansion; working capital revolving lines of credit; inventory. The firm also provides bridge financing to IPO or mergers and acquisitions or technology acquisition; dividend recapitalizations and other sources of investor liquidity; cash flow financing to protect against share price volatility; competitor acquisition; pre-IPO financing for extra cash on the balance sheet; public company financing to continue asset growth and production capacity; short-term bridge financing; and strategic and intellectual property acquisition financings. It also focuses on customized financing solutions, emerging growth, mid venture, and late venture financing. The firm invests primarily in structured debt with warrants and, to a lesser extent, in senior debt and equity investments. The firm generally seeks to invest in companies that have been operating for at least six to 12 months prior to the date of their investment. It prefers to invest in technology, SaaS Finance, energy technology, sustainable and renewable technology, and life sciences. Within technology the firm focuses on advanced specialty materials and chemicals; communication and networking, consumer and business products; consumer products and services, digital media and consumer internet; electronics and computer hardware; enterprise software and services; gaming; healthcare services; information services; business services; media, content and information; mobile; resource management; security software; semiconductors; semiconductors and hardware; and software sector. Within energy technology, it invests in agriculture; clean technology; energy and renewable technology, fuels, and power technology; geothermal; smart grid and energy efficiency and monitoring technologies; solar; and wind. Within life sciences, the firm invests in biopharmaceuticals; biotechnology tools; diagnostics; drug discovery, drug platform, development, and delivery; medical devices and equipment; surgical devices; therapeutics; pharma services; and specialty pharmaceuticals. Within sustainable and renewables, it invests in Vehicle Technology, Energy Generation and Storage, Ag Technology, Advanced Materials, and Industry 4.0. It also invests in educational services. The firm invests primarily in United States based companies and considers investment in the West Coast, Mid-Atlantic regions, Southeast and Midwest, particularly in the areas of software, biotech, and information services. The firm prefers to invest between $5 million and $200 million in equity per transactions. It invests generally between $1 million and $40 million in companies focused primarily on business services, communications, electronics, hardware, and healthcare services. The firm invests primarily in private companies but also have investments in public companies. For equity investments, the firm seeks to represent a controlling interest in its portfolio companies which may exceed 25% of the voting securities of such companies. The firm seeks to invest a limited portion of its assets in equipment-based loans to early-stage prospective portfolio companies. These loans are generally for amounts up to $3 million but may be up to $15 million for certain energy technology venture investments. The firm allows certain debt investments have the right to convert a portion of the debt investment into equity. It also co-invests with other private equity firms. The firm seeks to exit its investments through initial public offering, a private sale of equity interest to a third party, a merger or an acquisition of the company or a purchase of the equity position by the company or one of its stockholders. The firm has structured debt with warrants which typically have maturities of between two and seven years with an average of three years; senior debt with an investment horizon of less than three years; equipment loans with an investment horizon ranging from three to four years; and equity related securities with an investment horizon ranging from three to seven years. The firm prefers to invest through its balance sheet capital. The firm formerly known as Hercules Technology Growth Capital, Inc. Hercules Capital, Inc. was founded in December 2003 and is based in San Mateo, California with additional offices in North America and Europe.", "fullTimeEmployees": 100, "companyOfficers": [{"maxAge": 1, "name": "Mr. Scott  Bluestein", "age": 45, "title": "CEO, Chief Investment Officer, President & Director", "yearBorn": 1978, "fiscalYear": 2023, "totalPay": 3872500, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Seth Hardy Meyer", "age": 54, "title": "CFO & Chief Accounting Officer", "yearBorn": 1969, "fiscalYear": 2023, "totalPay": 1415000, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Christian  Follmann", "age": 40, "title": "Chief Operating Officer", "yearBorn": 1983, "fiscalYear": 2023, "totalPay": 747500, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Kiersten Zaza Botelho", "age": 37, "title": "Corporate Secretary, Chief Legal & Compliance Officer", "yearBorn": 1986, "fiscalYear": 2023, "totalPay": 717500, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Steve  Kuo", "age": 48, "title": "Senior MD & Group Head of Technology", "yearBorn": 1975, "fiscalYear": 2023, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Michael W. Hara", "title": "Managing Director of Investor Relations & Corporate Communications", "fiscalYear": 2023, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Ms. Kate  Kinlin", "title": "VP of Human Resources", "fiscalYear": 2023, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Roy Y. Liu", "age": 62, "title": "Managing Director", "yearBorn": 1961, "fiscalYear": 2023, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. R. Bryan Jadot", "age": 59, "title": "Senior MD & Group Head of Life Sciences", "yearBorn": 1964, "fiscalYear": 2023, "exercisedValue": 0, "unexercisedValue": 0}, {"maxAge": 1, "name": "Mr. Michael  Bowden", "title": "Managing Director of Portfolio Management", "fiscalYear": 2023, "exercisedValue": 0, "unexercisedValue": 0}], "compensationAsOfEpochDate": 1703980800, "maxAge": 86400, "priceHint": 2, "previousClose": 18.89, "open": 18.95, "dayLow": 18.8701, "dayHigh": 19.07, "regularMarketPreviousClose": 18.89, "regularMarketOpen": 18.95, "regularMarketDayLow": 18.8701, "regularMarketDayHigh": 19.07, "dividendRate": 1.92, "dividendYield": 0.1016, "exDividendDate": 1723507200, "payoutRatio": 1.0726, "fiveYearAvgDividendYield": 9.81, "beta": 1.346, "trailingPE": 10.592178, "forwardPE": 9.339901, "volume": 547228, "regularMarketVolume": 547228, "averageVolume": 1076954, "averageVolume10days": 801650, "averageDailyVolume10Day": 801650, "bid": 18.76, "ask": 18.93, "bidSize": 1100, "askSize": 1400, "marketCap": 3078629888, "fiftyTwoWeekLow": 15.02, "fiftyTwoWeekHigh": 21.78, "priceToSalesTrailing12Months": 6.335855, "fiftyDayAverage": 19.8812, "twoHundredDayAverage": 18.4123, "trailingAnnualDividendRate": 1.6, "trailingAnnualDividendYield": 0.084700905, "currency": "USD", "enterpriseValue": 4762989056, "profitMargins": 0.57822, "floatShares": 147625441, "sharesOutstanding": 162375008, "sharesShort": 5873941, "sharesShortPriorMonth": 6239455, "sharesShortPreviousMonthDate": 1721001600, "dateShortInterest": 1723680000, "sharesPercentSharesOut": 0.036199998, "heldPercentInsiders": 0.0189, "heldPercentInstitutions": 0.26584998, "shortRatio": 4.03, "shortPercentOfFloat": 0.0369, "bookValue": 11.591, "priceToBook": 1.6357518, "lastFiscalYearEnd": 1703980800, "nextFiscalYearEnd": 1735603200, "mostRecentQuarter": 1719705600, "earningsQuarterlyGrowth": -0.558, "netIncomeToCommon": 278169984, "trailingEps": 1.79, "forwardEps": 2.03, "pegRatio": 1.85, "enterpriseToRevenue": 9.802, "enterpriseToEbitda": 11.757, "exchange": "NYQ", "quoteType": "EQUITY", "symbol": "HTGC", "underlyingSymbol": "HTGC", "shortName": "Hercules Capital, Inc.", "longName": "Hercules Capital, Inc.", "firstTradeDateEpochUtc": 1118323800, "timeZoneFullName": "America/New_York", "timeZoneShortName": "EDT", "uuid": "2c8c1c96-6eae-3ded-84b0-fc0ac6353a4e", "gmtOffSetMilliseconds": -14400000, "currentPrice": 18.96, "targetHighPrice": 25.0, "targetLowPrice": 16.0, "targetMeanPrice": 20.58, "targetMedianPrice": 20.0, "recommendationMean": 2.4, "recommendationKey": "buy", "numberOfAnalystOpinions": 9, "totalCash": 27676000, "totalCashPerShare": 0.173, "ebitda": 405113984, "totalDebt": 1766072064, "quickRatio": 0.381, "currentRatio": 0.465, "totalRevenue": 485905984, "debtToEquity": 95.127, "revenuePerShare": 3.146, "returnOnAssets": 0.073359996, "returnOnEquity": 0.16325001, "freeCashflow": 224922752, "operatingCashflow": -165887008, "earningsGrowth": -0.621, "revenueGrowth": 0.076, "grossMargins": 1.0, "ebitdaMargins": 0.83373, "operatingMargins": 0.83088994, "financialCurrency": "USD", "trailingPegRatio": null, "__fetch_time": "2024-09-05"}]